In [746]:
import pandas as pd

### <font color="blue">Create a pandas series</font>

In [747]:
series=pd.Series([10,88,3,4,5])
series

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [748]:
type(series)

pandas.core.series.Series

In [749]:
series.axes

[RangeIndex(start=0, stop=5, step=1)]

In [750]:
series.dtype

dtype('int64')

In [751]:
series.size

5

In [752]:
series.ndim

1

In [753]:
series.values

array([10, 88,  3,  4,  5], dtype=int64)

In [754]:
series.head(3)

0    10
1    88
2     3
dtype: int64

In [755]:
series.tail(3)

2    3
3    4
4    5
dtype: int64

### <font color="blue">Index naming</font>

In [756]:
pd.Series([99,22,332,94,5], index = [1,3,5,7,9])

1     99
3     22
5    332
7     94
9      5
dtype: int64

In [757]:
series=pd.Series([99,22,332,94,5], index = ["a","b","c","d","e"])

In [758]:
series["a"]

99

In [759]:
series["a":"c"]

a     99
b     22
c    332
dtype: int64

### <font color="blue">Create a series with  dict</font>

In [760]:
dict={"reg":10,"log":11,"cart":12}
series=pd.Series(dict)
series

reg     10
log     11
cart    12
dtype: int64

### <font color="blue">Creating a series by concatenation two series</font>

In [761]:
pd.concat([series,series])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

### <font color="blue">Element operations</font>

In [762]:
import numpy as np
a=np.array([1,2,33,444,75])
series=pd.Series(a)
series

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [763]:
series[0]

1

In [764]:
series[0:3]

0     1
1     2
2    33
dtype: int32

In [765]:
series=pd.Series([121,200,150,99],index=["reg","loj","cart","rf"]) 
series

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [766]:
series.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [767]:
series.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [768]:
list(series.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

### <font color="blue">Querying elements in a series</font>

In [769]:
"reg" in series

True

In [770]:
"a" in series

False

In [771]:
series[["rf","reg"]]

rf      99
reg    121
dtype: int64

In [772]:
series["reg"]=130
series["reg"]

130

In [773]:
series["reg":"loj"]

reg    130
loj    200
dtype: int64

### <font color="blue">Creating dataframe</font>

In [774]:
l=[1,2,39,67,90]
l

[1, 2, 39, 67, 90]

In [775]:
pd.DataFrame(l, columns=["first"])

   first
0      1
1      2
2     39
3     67
4     90

In [776]:
m=np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [777]:
df=pd.DataFrame(m, columns=["first","second","third"])
df

   first  second  third
0      1       2      3
1      4       5      6
2      7       8      9

### <font color="blue">Dataframe renaming</font>

In [778]:
df.columns=("first1","second1","third1")
df

   first1  second1  third1
0       1        2       3
1       4        5       6
2       7        8       9

In [779]:
type(df)

pandas.core.frame.DataFrame

In [780]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['first1', 'second1', 'third1'], dtype='object')]

In [781]:
df.shape

(3, 3)

In [782]:
df.ndim

2

In [783]:
df.size

9

In [784]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [785]:
df.head()

   first1  second1  third1
0       1        2       3
1       4        5       6
2       7        8       9

In [786]:
df.tail()

   first1  second1  third1
0       1        2       3
1       4        5       6
2       7        8       9

### <font color="blue">Element operations</font>

In [787]:
s1=np.random.randint(10, size=5)
s2=np.random.randint(10, size=5)
s3=np.random.randint(10, size=5)

In [788]:
dict={"var1":s1,"var2":s2,"var3":s3}
dict

{'var1': array([7, 7, 0, 4, 3]),
 'var2': array([2, 8, 6, 2, 0]),
 'var3': array([5, 8, 1, 2, 7])}

In [789]:
df=pd.DataFrame(dict)
df

   var1  var2  var3
0     7     2     5
1     7     8     8
2     0     6     1
3     4     2     2
4     3     0     7

In [790]:
df[0:1]

   var1  var2  var3
0     7     2     5

In [791]:
df.index=["a","b","c","d","e",]
df

   var1  var2  var3
a     7     2     5
b     7     8     8
c     0     6     1
d     4     2     2
e     3     0     7

In [792]:
df["c":"e"]

   var1  var2  var3
c     0     6     1
d     4     2     2
e     3     0     7

In [793]:
df.drop("a",axis=0)

   var1  var2  var3
b     7     8     8
c     0     6     1
d     4     2     2
e     3     0     7

In [794]:
df

   var1  var2  var3
a     7     2     5
b     7     8     8
c     0     6     1
d     4     2     2
e     3     0     7

In [795]:
df.drop("a",axis=0,inplace=True)
df

   var1  var2  var3
b     7     8     8
c     0     6     1
d     4     2     2
e     3     0     7

In [796]:
l=["c","e"]
df.drop(l, axis=0 )

   var1  var2  var3
b     7     8     8
d     4     2     2

In [797]:
"var1" in df

True

In [798]:
l=["var1","var4","var2"]
for i in l:
    print(i in df)

True
False
True

In [799]:
df["var4"]=df['var1']*df['var2']
df

   var1  var2  var3  var4
b     7     8     8    56
c     0     6     1     0
d     4     2     2     8
e     3     0     7     0

In [800]:
df.drop("var4", axis=1 , inplace=True)
df

   var1  var2  var3
b     7     8     8
c     0     6     1
d     4     2     2
e     3     0     7

In [801]:
l=["var1","var2"]
df.drop(l, axis=1)

   var3
b     8
c     1
d     2
e     7

 ### <font color="blue">Observation and variable selection: loc ,iloc</font>

In [802]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30 ,size=(10,3))
df=pd.DataFrame(m, columns=["var1", "var2", "var3"])
df

   var1  var2  var3
0    16    26    20
1    11     8     7
2    11    21     5
3    23    15    26
4     2    21    12
5     7     7    13
6    17    23    20
7     8    28    25
8     5    21     8
9    15    11     6

In [803]:
#real life indexing
df.loc[0:3]

   var1  var2  var3
0    16    26    20
1    11     8     7
2    11    21     5
3    23    15    26

In [804]:
#default indexing
df.iloc[0:3]

   var1  var2  var3
0    16    26    20
1    11     8     7
2    11    21     5

In [805]:
df.iloc[0,0]

16

In [806]:
df.iloc[:3,:2]

   var1  var2
0    16    26
1    11     8
2    11    21

In [807]:
df.loc[0:3, "var3"]

0    20
1     7
2     5
3    26
Name: var3, dtype: int32

In [808]:
df.iloc[0:3]["var3"]

0    20
1     7
2     5
Name: var3, dtype: int32

### <font color='blue'>Conditional element operations</font>

In [809]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30 ,size=(10,3))
df=pd.DataFrame(m, columns=["var1", "var2", "var3"])
df

   var1  var2  var3
0    19    24    27
1    22    25    23
2    28     7    16
3     2    12    16
4    27    17    22
5     9    17    20
6    17     4    20
7     9     9     6
8    22    21     3
9    18    26    18

In [810]:
df["var1"]

0    19
1    22
2    28
3     2
4    27
5     9
6    17
7     9
8    22
9    18
Name: var1, dtype: int32

In [811]:
df["var1"][0:2]

0    19
1    22
Name: var1, dtype: int32

In [812]:
df[0:2] [["var1", "var2"]]

   var1  var2
0    19    24
1    22    25

In [813]:
df[df.var1> 15] [["var1"]]

   var1
0    19
1    22
2    28
4    27
6    17
8    22
9    18

In [814]:
df[(df.var1> 15) & (df.var3<5)]

   var1  var2  var3
8    22    21     3

In [815]:
df[df.var1> 15] [["var1","var2"]]

   var1  var2
0    19    24
1    22    25
2    28     7
4    27    17
6    17     4
8    22    21
9    18    26

### <font color='blue'>Join</font>

In [816]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30 ,size=(5,3))
df1=pd.DataFrame(m, columns=["var1", "var2", "var3"])
df1

   var1  var2  var3
0     2    18    19
1    12    24    12
2    12    14    11
3    26    16    12
4    26     4    15

In [817]:
df2=df1+99
df2

   var1  var2  var3
0   101   117   118
1   111   123   111
2   111   113   110
3   125   115   111
4   125   103   114

In [818]:
#pd.concat([df1,df2]).reset_index() first drops the index column and then adds it from the beginning
pd.concat([df1,df2],ignore_index=True)

   var1  var2  var3
0     2    18    19
1    12    24    12
2    12    14    11
3    26    16    12
4    26     4    15
5   101   117   118
6   111   123   111
7   111   113   110
8   125   115   111
9   125   103   114

In [819]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [820]:
df2.columns=["var1","var2","deg3"]
df2

   var1  var2  deg3
0   101   117   118
1   111   123   111
2   111   113   110
3   125   115   111
4   125   103   114

In [821]:
pd.concat([df1,df2],ignore_index=True, join='inner')

   var1  var2
0     2    18
1    12    24
2    12    14
3    26    16
4    26     4
5   101   117
6   111   123
7   111   113
8   125   115
9   125   103

In [822]:
pd.concat([df1, df2.reindex(columns = df1.columns)], ignore_index = True)

   var1  var2  var3
0     2    18  19.0
1    12    24  12.0
2    12    14  11.0
3    26    16  12.0
4    26     4  15.0
5   101   117   NaN
6   111   123   NaN
7   111   113   NaN
8   125   115   NaN
9   125   103   NaN

### <font color='blue'>Advanced concatenation operations</font>

##### <font color='blue'>Merge</font>

In [823]:
#One to one

In [824]:
df1 = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'grup': ['Muhasebe', 'Muhendislik', 'Muhendislik', 'İK']})

df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [825]:
df2 = pd.DataFrame({'calisanlar': ['Ayse', 'Ali', 'Veli', 'Fatma'],
                    'ilk_giris': [2010, 2009, 2014, 2019]})

df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [826]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [827]:
pd.merge(df1,df2, on="calisanlar")

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [828]:
#many to one

In [829]:
df3=pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [830]:
df4 = pd.DataFrame({'grup': ['Muhasebe', 'Muhendislik', 'İK'],
                    'mudur': ['Caner', 'Mustafa', 'Berkcan']})

df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [831]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           İK       2019  Berkcan

In [832]:
# many to many

In [833]:
df5 = pd.DataFrame({'grup': ['Muhasebe', 'Muhasebe',
                              'Muhendislik', 'Muhendislik', 'İK', 'İK'],
                    'yetenekler': ['matematik', 'excel', 'kodlama', 'linux',
                               'excel', 'yonetim']})

df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [834]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [835]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim

### <font color='blue'>Aggregation & Grouping</font>

Basit toplulaştırma fonksiyonları:

* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [836]:
import seaborn as sns

In [837]:
df=sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [838]:
df.shape

(1035, 6)

In [839]:
df.mean(numeric_only=True)

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [840]:
df["mass"].mean()

2.6381605847953216

In [841]:
df["mass"].count()

513

In [842]:
df["mass"].min()

0.0036

In [843]:
df["mass"].max()

25.0

In [844]:
df["mass"].sum()

1353.37638

In [845]:
df["mass"].std()

3.8186166509616046

In [846]:
df["mass"].var()

14.58183312700122

In [847]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [848]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

#### <font color='blue'> Grouping</font>

In [849]:
import seaborn as sns
import numpy as np
import pandas as pd
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'veri': [10,11,52,23,43,55]}, columns=['gruplar', 'veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [850]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [851]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [852]:
df=sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [853]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [854]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

### <font color='blue'>Advanced aggregation operations(Aggregate,Filter,Transform,Apply)</font>

In [855]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

#### <font color='blue'>Aggregate</font>

In [856]:
df.groupby("gruplar").aggregate(["min" ,"median","max"])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [857]:
df.groupby("gruplar").aggregate({"degisken1" :"min","degisken2":"max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

#### <font color='blue'>Filter</font>

In [858]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [859]:
def filter_func(x):
   return x["degisken1"].std() > 9

df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [860]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

#### <font color='blue'>Transform</font>

In [861]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [862]:
df_a=df.iloc[:,1:3]

In [863]:
df_a.transform(lambda x: x-x.mean())

   degisken1  degisken2
0      -23.0     -238.0
1      -10.0      -85.0
2        0.0       -5.0
3      -11.0      -76.0
4      -22.0     -227.0
5       66.0      631.0

In [864]:
df_a.transform(lambda x: (x-x.mean())/x.std())

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

#### <font color='blue'>Apply</font>

In [865]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [866]:
df.apply(np.sum)

gruplar      ABCABC
degisken1       198
degisken2      2028
dtype: object

In [867]:
df.groupby("gruplar").apply(np.mean)

gruplar
A     98.5
B     99.5
C    358.5
dtype: float64

In [868]:
df.groupby("gruplar").apply(np.sum,axis=0)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

### <font color='blue'>Pivot Tables</font>

In [869]:
import pandas as pd
import seaborn as sns
titanic=sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [870]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [871]:
titanic.groupby(["sex","class"], observed=False)[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [872]:
#table with pivot
titanic.pivot_table("survived",index="sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [873]:
age=pd.cut(titanic["age"] , [0, 18, 90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [874]:
titanic.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

### <font color='blue'>Reading Data</font>

In [875]:
import pandas as pd

In [876]:
#reading csv
df=pd.read_csv("reading_data/ornekcsv.csv",sep=";")
df

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [877]:
#reading txt
df=pd.read_csv("reading_data/duz_metin.txt")
df

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [878]:
#reading 
df=pd.read_excel("reading_data/ornekx.xlsx")
df

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [879]:
type(df)

pandas.core.frame.DataFrame

In [880]:
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [881]:
df.columns=["A","B","C"]
df

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [882]:
tips= pd.read_csv("reading_data/tips.csv")
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4